# ViewSheetSetting Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSetting Class
Members See Also
---
Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ViewSheetSetting : APIObject
```

Visual Basic
---
```text
Public Class ViewSheetSetting _
	Inherits APIObject
```

Visual C++
---
```text
public ref class ViewSheetSetting : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ViewSheetSetting
# See Also
ViewSheetSetting Members
Autodesk.Revit.DB Namespace